---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.JoiningDisjoint
source: html/c8a1377b-06cb-e713-2046-f88c8a03fbb9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.JoiningDisjoint Property

Highlighted elements are joined but do not intersect.

## Syntax (C#)
```csharp
public static FailureDefinitionId JoiningDisjoint { get; }
```